kAMDSuccess = "Ingen feil.";
kAMDUndefinedError = "Det oppsto en ukjent feil.";
kAMDBadHeaderError = "Kunne ikke overføre fil.";
kAMDNoResourcesError = "Kunne ikke tildele en ressurs.";
kAMDReadError = "Kunne ikke lese fra enheten.";
kAMDWriteError = "Kunne ikke skrive til enheten.";
kAMDUnknownPacketError = "Pakken er ukjent.";
kAMDInvalidArgumentError = "Argumentet er ikke gyldig.";
kAMDNotFoundError = "Fant ikke filen.";
kAMDIsDirectoryError = "Banen er en mappe.";
kAMDPermissionError = "Du har ikke tillatelse.";
kAMDNotConnectedError = "Ikke koblet til enheten.";
kAMDTimeOutError = "Handlingen ble tidsavbrutt.";
kAMDOverrunError = "Det oppsto en bufferoverflyt.";
kAMDEOFError = "Slutten på filen.";
kAMDUnsupportedError = "Det er ikke støtte for denne operasjonen.";
kAMDFileExistsError = "Filen finnes allerede.";
kAMDBusyError = "Enheten er opptatt.";
kAMDCryptoError = "Kunne ikke opprette en sikker forbindelse til enheten. ";
kAMDTooBigError = "Meldingen er for stor.";
kAMDInvalidResponseError = "Mottok et uventet svar fra enheten.";
kAMDMissingKeyError = "Nøkkelen mangler.";
kAMDMissingValueError = "Verdien mangler.";
kAMDGetProhibitedError = "Kan ikke hente verdi fra den kodelåste enheten.";
kAMDSetProhibitedError = "Kan ikke angi verdi på enhet.";
kAMDRemoveProhibitedError = "Kan ikke fjerne verdi på enhet.";
kAMDImmutableValueError = "Denne verdien kan ikke endres.";
kAMDPasswordProtectedError = "Enheten er beskyttet med kode.";
kAMDMissingHostIDError = "Enheten kjenner ikke igjen denne verten.";
kAMDInvalidHostIDError = "Enheten kjenner ikke igjen denne verten.";
kAMDSessionActiveError = "Økten er aktiv.";
kAMDSessionInactiveError = "Økten er inaktiv.";
kAMDMissingSessionIDError = "Økt-ID-en mangler.";
kAMDInvalidSessionIDError = "Økt-ID-en er ugyldig.";
kAMDMissingServiceError = "Tjenesten mangler.";
kAMDInvalidServiceError = "Tjenesten er ugyldig.";
kAMDServiceLimitError = "For mange aktive forekomster av tjenesten.";
kAMDCheckinSetupFailedError = "Kunne ikke starte tjeneste på enheten";
kAMDInvalidCheckinError = "Kunne ikke starte tjeneste på enheten";
kAMDCheckinTimeoutError = "Tjenesten startet ikke på riktig måte på enheten.";
kAMDCheckinConnectionFailedError = "Tjenesten startet ikke på riktig måte på enheten.";
kAMDCheckinReceiveFailedError = "Tjenesten startet ikke på riktig måte på enheten.";
kAMDCheckinResponseFailedError = "Tjenesten startet ikke på riktig måte på enheten.";
kAMDCheckinOutOfMemoryError = "Tjenesten startet ikke på riktig måte på enheten.";
kAMDCheckinSendFailedError = "Tjenesten startet ikke på riktig måte på enheten.";
kAMDMissingPairRecordError = "Verten er ikke sammenkoblet med enheten.";
kAMDInvalidPairRecordError = "Verten er ikke lenger sammenkoblet med enheten.";
kAMDSavePairRecordFailedError = "Kunne ikke arkivere sammenkoblingsoppføringen.";
kAMDInvalidActivationRecordError = "Aktiveringsoppføringen er ikke gyldig.";
kAMDMissingActivationRecordError = "Fant ikke aktiveringsoppføringen.";
kAMDServiceProhibitedError = "Tjenesten kunne ikke startes på enheten.";
kAMDEscrowLockedError = "Enheten er ikke tilgjengelig før første opplåsing etter oppstart.";
kAMDProhibitedBySupervision = "Operasjonen er ikke tillatt på enheter under tilsyn.";
kAMDPairingProhibitedError = "Sammenkobling er bare tillatt over USB.";
kAMDWrongDroidError = "Enheten er i gjenopprettingsmodus.";
kAMDSUVerificationError = "Programvareoppdateringspakken kunne ikke verifiseres.";
kAMDSUPatchError = "Kunne ikke oppdatere filen.";
kAMDSUFirmwareError = "Kunne ikke oppdatere firmwaren.";
kAMDProvisioningProfileNotValid = "Klargjøringsprofilen er ikke gyldig.";
kAMDSendMessageError = "Kunne ikke sende en melding til enheten.";
kAMDReceiveMessageError = "Kunne ikke motta en melding fra enheten.";
kAMDMissingOptionsError = "Alternativene mangler.";
kAMDMissingImageTypeError = "Bildet mangler.";
kAMDDigestFailedError = "Kunne ikke lese diskfil.";
kAMDStartServiceError = "Tjenesten kunne ikke startes.";
kAMDInvalidDiskImageError = "Diskfilen er ugyldig.";
kAMDMissingDigestError = "Sammendraget mangler.";
kAMDMuxError = "Det oppsto en feil med USB-enhetsmultiplekseren.";
kAMDApplicationAlreadyInstalledError = "Et systemprogram med den angitte pakkeidentifikatoren er allerede installert på enheten og kan ikke erstattes.";
kAMDApplicationMoveFailedError = "Programmet kunne ikke flyttes på plass på enheten.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Programmet kunne ikke plasseres i sandkasse.";
kAMDApplicationVerificationFailedError = "Programmet kunne ikke verifiseres.";
kAMDArchiveDestructionFailedError = "Kunne ikke fjerne programarkivet.";
kAMDBundleVerificationFailedError = "Programpakken kunne ikke verifiseres.";
kAMDCarrierBundleCopyFailedError = "Kunne ikke installere operatørpakken.";
kAMDCarrierBundleDirectoryCreationFailedError = "Kunne ikke opprette katalog for operatørpakke.";
kAMDCarrierBundleMissingSupportedSIMsError = "Ingen støttede SIM-kort for denne operatørpakken.";
kAMDCommCenterNotificationFailedError = "Kunne ikke lytte etter melding fra baseband.";
kAMDContainerCreationFailedError = "Kunne ikke opprette programbeholder.";
kAMDContainerP0wnFailedError = "Kunne ikke reparere rettigheter på programbeholderen.";
kAMDContainerRemovalFailedError = "Kunne ikke fjerne programbeholderen.";
kAMDEmbeddedProfileInstallFailedError = "Kunne ikke installere den integrerte klargjøringsprofilen.";
kAMDErrorError = "Det oppsto en feil.";
kAMDExecutableTwiddleFailedError = "Kunne ikke endre utførbare rettigheter på programmet.";
kAMDExistenceCheckFailedError = "Kunne ikke kontrollere om programmet allerede finnes.";
kAMDInstallMapUpdateFailedError = "Kunne ikke oppdatere listen med installerte programmer.";
kAMDManifestCaptureFailedError = "Kunne ikke arkivere programmanifestet.";
kAMDMapGenerationFailedError = "Kunne ikke generere programliste.";
kAMDMissingBundleExecutableError = "Programpakken inneholder ikke en gyldig utførbar fil.";
kAMDMissingBundleIdentifierError = "Programpakken inneholder ikke en gyldig identifikator.";
kAMDMissingBundlePathError = "Kunne ikke finne banen til programpakken.";
kAMDMissingContainerError = "Fant ikke beholderen for det installerte programmet.";
kAMDNotificationFailedError = "Kunne ikke sende en melding.";
kAMDPackageExtractionFailedError = "Kunne ikke åpne programpakken.";
kAMDPackageInspectionFailedError = "Kunne ikke inspisere programpakken.";
kAMDPackageMoveFailedError = "Kunne ikke flytte programpakken til den midlertidige plasseringen.";
kAMDPathConversionFailedError = "Kunne ikke konvertere banen.";
kAMDRestoreContainerFailedError = "Kunne ikke gjenopprette programbeholderen.";
kAMDSeatbeltProfileRemovalFailedError = "Kunne ikke fjerne setebelteprofil for programmet.";
kAMDStageCreationFailedError = "Kunne ikke opprette midlertidig katalog.";
kAMDSymlinkFailedError = "Kunne ikke opprette den symbolske koblingen.";
kAMDiTunesArtworkCaptureFailedError = "Kunne ikke arkivere iTunes-bildet.";
kAMDiTunesMetadataCaptureFailedError = "Kunne ikke arkivere iTunes-metadata.";
kAMDAlreadyArchivedError = "Programmet er allerede lagt i et arkiv.";
kAMDUnknownCommandError = "Enheten kjenner ikke igjen kommandoen.";
kAMDAPIInternalError = "Det oppsto en intern API-feil.";
kAMDMuxCreateListenerError = "Kunne ikke lytte etter USB-enheter.";
kAMDMuxGetListenerError = "Kunne ikke hente USB-lytteren.";
kAMDMuxConnectError = "Kunne ikke koble til enheten.";
kAMDDeviceTooNewError = "Dette programmet må oppdateres.";
kAMDDeviceRefNoGood = "Enheten er ikke lenger koblet til.";
kAMDDeviceDisconnectedError = "Enheten er ikke lenger koblet til.";
kAMDCannotTranslateError = "Kunne ikke oversette meldinger fra enhet.";
kAMDMobileImageMounterMissingImageSignature = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterResponseCreationFailed = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterMissingImageType = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterMissingImagePath = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterImageMapLoadFailed = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterAlreadyMounted = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterImageMoveFailed = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterMountPathMissing = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterMountPathNotEmpty = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterImageMountFailed = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterDigestFailed = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterDigestCreationFailed = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterImageVerificationFailed = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterImageInfoCreationFailed = "Kunne ikke støtte utvikling.";
kAMDMobileImageMounterImageMapStoreFailed = "Kunne ikke støtte utvikling.";
kAMDDeviceOSVersionTooLow = "OS-versjonen på enheten er for lav.";
kAMDNoWifiSyncSupportError = "Enheten støtter ikke trådløs synkronisering.";
kAMDDeviceFamilyNotSupported = "Programmet støtter ikke denne typen enhet.";
kAMDPackagePatchFailedError = "Kunne ikke oppdatere programmet.";
kAMDIncorrectArchitectureError = "Programmet støtter ikke CPU-typen til enheten.";
kAMDPluginCopyFailedError = "Kunne ikke kopiere VPN-programtillegget i programbeholderen.";
kAMDBreadcrumbFailedError = "Kunne ikke skrive navigasjonsstiinstallering.";
kAMDBreadcrumbUnlockError = "Kunne ikke oppdatere navigasjonsstiinstallering.";
kAMDGeoJSONCaptureFailedError = "Kunne ikke arkivere GeoJSON-dataene.";
kAMDNewsstandArtworkCaptureFailedError = "Kunne ikke arkivere Aviskiosk-bildet.";
kAMDMissingCommandError = "Forespørselen inneholdt ingen kommando.";
kAMDNotEntitledError = "Programmet har ikke tillatelse til å sende en slik forespørsel.";
kAMDMissingPackagePathError = "Forespørselen manglet pakkestien.";
kAMDMissingContainerPathError = "Forespørselen manglet beholderstien.";
kAMDMissingApplicationIdentifierError = "Forespørselen manglet progamidentifikatoren.";
kAMDMissingAttributeValueError = "Forespørselen manglet en nødvendig verdi.";
kAMDLookupFailedError = "Kunne ikke vise installerte programmer.";
kAMDDictCreationFailedError = "Kunne ikke hente ut egenskapene fra forespørselen.";

/* kMISFileError */
"A file operation failed." = "En filoperasjon mislyktes.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "En signert ressurs er lagt til, endret eller slettet.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Det ble ikke funnet noen gyldig klargjøringsprofil for den utførbare filen.";

/* kMISUnknownError */
"An unknown error has occurred." = "Det oppsto en ukjent feil.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Prøvde å endre en klargjøringsprofil som ikke kan endres.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "Programmet har ikke gyldig signatur.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "Signaturen til programmet er gyldig, men stemmer ikke med den forventede verdien.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "Den utførbare filen inneholder en ugyldig signatur.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "Den utførbare filen ble signert med ugyldige rettigheter.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "Identiteten som ble brukt til å signere den utførbare filen, er ikke lenger gyldig.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "Signaturen var ikke gyldig.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Det oppsto en feil ved kommunikasjon med enheten.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Klargjøringsprofilen kan ikke installeres på denne enheten.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Klargjøringsprofilen har ingen gyldig signatur (eller den har en gyldig, men ikke godkjent signatur).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Klargjøringsprofilen er utløpt.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Klargjøringsprofilen har feil format.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Klargjøringsprofilen støttes ikke.";

/* kMISAllocationError */
"Unable to allocate memory." = "Kan ikke tildele hukommelse.";

